## 2주차 수업내용 (1851782, 이소정)##

print("이소정","동아대학교","안녕하세요")
print("\\반가워요!\\\n\n","코로나\t","\b조심하세요!")
a= int(input("데이터 입력 1 ==>"))         ## 문자끼리 곱할 수 없으니 숫자형으로 바꾸자-> int ##
b= int(input("데이터 입력 2 ==>"))
print("%d * %d = %10d" % (a,b,a*b))  # 정수 10자리
print("%d * %d = %10.3f" % (a,b,a*b))  #총 10자리, 소수점 3번째 자리

#print("\n","\t동아대학교","\b안녕하세요")

a=50; b= 40.5
print (type(a), type(b))  #변수 선언!! 어떤 변수인지 밝혀라 인듯??

#a= int(input("데이터 입력 1 ==>"))  #정수와 실수 계산 ## 문자끼리 곱할 수 없으니 정수형으로 바꾸자 int ###
#b= float(input("데이터 입력 2 ==>"))  # git 실수형으로 바꿔#
#print("%d * %f = %fu" % (a,b,a*b)) #%10.3f - 총 10자리고 , 소수점 3번째 자리



